app/controllers/items_controller.rb

  def show
    @item = Item.find(params[:id])
---
SELECT * FROM "items" WHERE ("items"."id" = 1)

  def create
    @item = Item.new(params[:item])

    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("name", "updated_at", "description", "created_at") VALUES('Something', '2008-12-05 19:19:51', 'Something', '2008-12-05 19:19:51')